## Name : Shreekant Sunil Lohagale
## Year & Div : TY-AIML-B
## Roll No. : 32

## Assignment No 3

---
#Apply normalization, standardization, and encoding on categorical features. Perform basic feature scaling.

In [1]:
import pandas as pd

# Dataset
data = {
    'Age': [22, 25, 28, 35, 40, 45, 52, 48, 30, 27],
    'Salary': [20000, 35000, 28000, 50000, 65000, 58000, 60000, 55000, 32000, 42000],
    'Experience_Years': [1, 2, 3, 7, 10, 9, 12, 11, 4, 3],
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female'],
    'City': ['Pune', 'Mumbai', 'Delhi', 'Pune', 'Chennai', 'Delhi', 'Bangalore', 'Pune', 'Mumbai', 'Chennai'],
    'Education': ['Bachelors', 'Masters', 'Bachelors', 'PhD', 'Masters', 'Bachelors', 'PhD', 'Bachelors', 'Masters', 'Bachelors']
}

df = pd.DataFrame(data)
print("Original Dataset:")
df

Original Dataset:

   Age  Salary  Experience_Years  Gender       City  Education
0   22   20000                 1    Male       Pune  Bachelors
1   25   35000                 2  Female     Mumbai    Masters
2   28   28000                 3  Female      Delhi  Bachelors
3   35   50000                 7    Male       Pune        PhD
4   40   65000                10  Female    Chennai    Masters
5   45   58000                 9    Male      Delhi  Bachelors
6   52   60000                12    Male  Bangalore        PhD
7   48   55000                11  Female       Pune  Bachelors
8   30   32000                 4    Male     Mumbai    Masters
9   27   42000                 3  Female    Chennai  Bachelors

In [2]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler, StandardScaler, LabelEncoder, OneHotEncoder

In [3]:
df.head()

   Age  Salary  Experience_Years  Gender     City  Education
0   22   20000                 1    Male     Pune  Bachelors
1   25   35000                 2  Female   Mumbai    Masters
2   28   28000                 3  Female    Delhi  Bachelors
3   35   50000                 7    Male     Pune        PhD
4   40   65000                10  Female  Chennai    Masters

In [4]:
from sklearn.preprocessing import MinMaxScaler
import pandas as pd

df = pd.DataFrame({'Salary':[20000, 35000, 48000, 60000]})
scaler = MinMaxScaler()
df['Salary_Norm'] = scaler.fit_transform(df[['Salary']])
print(df)

   Salary  Salary_Norm
0   20000        0.000
1   35000        0.375
2   48000        0.700
3   60000        1.000

In [5]:
from sklearn.preprocessing import StandardScaler
import pandas as pd

df = pd.DataFrame({'Age':[22,25,28,35]})
scaler = StandardScaler()
df['Age_Std'] = scaler.fit_transform(df[['Age']])
df

   Age   Age_Std
0   22 -1.140647
1   25 -0.518476
2   28  0.103695
3   35  1.555428

## Encoding Categorical Feature

In [6]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

# Sample dataset
df = pd.DataFrame({
    'Name': ['Ravi', 'Sneha', 'Amit', 'Pooja'],
    'Gender': ['Male', 'Female', 'Male', 'Female']
})

# Apply Label Encoding
le = LabelEncoder()
df['Gender_Label'] = le.fit_transform(df['Gender'])

print(df)

    Name  Gender  Gender_Label
0   Ravi    Male             1
1  Sneha  Female             0
2   Amit    Male             1
3  Pooja  Female             0

In [7]:
df.drop('Gender',axis=1,inplace=True)

In [8]:
df

    Name  Gender_Label
0   Ravi             1
1  Sneha             0
2   Amit             1
3  Pooja             0

In [9]:
# Simple Example: One Hot Encoding using sklearn

import pandas as pd
from sklearn.preprocessing import OneHotEncoder

# Sample dataset
data = {'City': ['Pune', 'Mumbai', 'Delhi', 'Pune']}
df = pd.DataFrame(data)
print("Original Data:")
print(df)

# Initialize the encoder
encoder = OneHotEncoder(sparse_output=False) #scikit-learn to return a dense NumPy array instead of a sparse matrix.

# Transform the data
encoded = encoder.fit_transform(df[['City']])

# Convert encoded data to DataFrame
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out(['City']))

# Combine with original data
final_df = pd.concat([df, encoded_df], axis=1)

print("\nOne Hot Encoded Data:")
print(final_df)

Original Data:
     City
0    Pune
1  Mumbai
2   Delhi
3    Pune

One Hot Encoded Data:
     City  City_Delhi  City_Mumbai  City_Pune
0    Pune         0.0          0.0        1.0
1  Mumbai         0.0          1.0        0.0
2   Delhi         1.0          0.0        0.0
3    Pune         0.0          0.0        1.0

In [10]:
import pandas as pd

# Sample Data
data = {'City': ['Pune', 'Mumbai', 'Delhi', 'Pune']}
df = pd.DataFrame(data)

# One Hot Encoding in Binary Format
encoded_df = pd.get_dummies(df, columns=['City']).astype(int)

print(encoded_df)

   City_Delhi  City_Mumbai  City_Pune
0           0            0          1
1           0            1          0
2           1            0          0
3           0            0          1